# Usage: `brew bundle Brewfile`
tap 'caskroom/cask'
tap 'goles/battery'
tap 'homebrew/bundle'

brew 'coreutils'
brew 'moreutils'
brew 'findutils'
brew 'gnu-sed', args: ['default-names']

brew 'grc'

# Languages
brew 'r'
brew 'go'
brew 'node'
brew 'rbenv'
brew 'ruby-build'
brew 'rbenv-binstubs'
brew 'rbenv-bundler'
brew 'rbenv-default-gems'
brew 'rbenv-gemset'

brew 'jsl'
brew 'jq'

brew 'wget', args: ['enable-iri']

brew 'tmux'
brew 'vim', args: ['override-system-vi']

# Docker
brew 'docker'
brew 'docker-machine'
brew 'docker-compose'
brew 'docker-swarm'

# Tools
brew 'battery'
brew 'apparix'
brew 'ag'
brew 'ctags'
brew 'ag'
brew 'git'
brew 'imagemagick', args: ['with-webp']
brew 'nmap'
brew 'p7zip'
brew 'pv'
brew 'tree'
brew 'fortune'
brew 'htop-osx'
brew 'nmap'

# Casks
cask 'adobe-reader'
cask 'flash-player'
cask 'crosspack-avr'
cask 'teensy'
cask 'handbrake'
cask 'hex-fiend'
cask 'iterm2'
cask 'vagrant'
cask 'virtualbox'
cask 'robomongo'
cask 'alfred'
cask 'google-chrome'
cask 'growlnotify'
cask 'totalspaces'
cask 'transmission'
cask 'vlc'
cask '1password'
cask 'things'
cask 'fantastical'
cask 'dropbox'
cask 'istat-menus'
cask 'the-unarchiver'
